// ООП
//
// Инкапсуляция
// К состоянию объекта имеет доступ сам объект и на прямую никто из внешнего мира не может изменять это состояние если нет специального метода на изменение данных
// ------
// Абстракция
// Принцип отделения концепции (общего) от конкретной реализации
// ------
// Наследование
// Это возможность порождать один класс от другого с сохранением всех свойст и методов класа-предка, добавляя при необходимости новые свойства и методы. Позволяет избежать дубляж кода
// ------
//Полиморфизм
// Возможность объектов с одинаковой спецификацией имень различную реализацию
// Наследник может выполнять команду базового класса по свойму
export const oop = () => {};
